"""
Задача 3. В переменной age хранится возраст. Вывести "Поздравляем вы поступили в ВГУИТ",
если age >= 16, иначе "Сначала нужно окончить школу!".
    1. Проверить, что значение age больше 0 и меньше 75.
    2. Проверить, что поступающего зовут не Иван.
    3. Если абитуриенту меньше 16, вывести, сколько лет ему еще учиться в школе.
"""

age = int(input("Возраст: "))
name = input("Имя: ")

if not (0 < age < 75):
    print("Некорректный возраст")
elif name == "Иван":
    print("Поступающего зовут Иван")
elif age >= 16:
    print("Поздравляем вы поступили в ВГУИТ")
else:
    print("Сначала нужно окончить школу!")
    print("Еще учиться в школе лет:", 16 - age)